export const HeroQuoteScriptDesc: Record<string, string> = {
  "00074B": "敌人在右侧", // 仅半藏
  "00088E": "运载目标受到攻击", // PVE
  "002733": "敌人在左侧",
  "002734": "敌人在右侧",
  "002735": "敌人在前方",
  "002736": "敌人在上方",
  "002737": "敌人在后方",
  "002738": "敌人在下方",
  "00329F": "复制美后使用终极技能",
  "007329": "渡轮受到攻击", // PVE
  "00732E": "传输塔受到攻击", // PVE
  "007C66": "复制源氏后使用终极技能",
  "007C67": "复制禅雅塔后使用终极技能",
  "007DE7": "复制士兵：76后使用终极技能",
  "0081B6": "巨炮受到攻击", // PVE
  "008A4E": "复制猎空后使用终极技能",
  "008C8E": "复制黑百合后使用终极技能",
  "008C8F": "复制死神后使用终极技能",
  "008C90": "复制西格玛后使用终极技能",
  "008C91": "复制莫伊拉后使用终极技能",
  "008C92": "复制末日铁拳后使用终极技能",
  "008C93": "复制黑影后使用终极技能",
  "009227": "暴击",
  "009268": "敌人在空中",
  "0092A4": "敌方莱因哈特冲锋",
  "0094DB": "修理站受到攻击",
  "00A1E8": "鲍勃造成消灭",
  "00A1E9": "鲍勃未造成消灭",
  "00A22A": "敌人被重力喷涌控制",
  "00A2EA": "治疗光束连接盟友",
  "00A364": "造成至少2个消灭", // 火炮模式结束
  "00A365": "未能造成消灭", // 火炮模式结束
  "00A556": "链钩命中空中敌人",
  "00A558": "烈焰打击击杀多名英雄",
  "00A5B5": "使用终极技能期间",
  "00A5FD": "被纳米激素强化时",
  "00A617": "敌人使用终极技能时",
  "00A662": "被灵狐强化时",
  "00A697": "敌人被纳米激素强化",
  "00A6B2": "敌人被引力乱流控制",
  "00A6B6": "被引力乱流控制时",
  "00A6FC": "高速移动时",
  "00A6FE": "敌人高速移动",
  "00A70E": "打断敌人位移技能",
  "00A747": "驾驶员形态时",
  "00A752": "近身攻击",
  "00A753": "敌人跳跃",
  "00A775": "直接命中", // 法老之鹰/狂鼠
  "00A776": "在空中时",
  "00A777": "被重力喷涌控制时",
  "00A788": "敌方黑影潜行",
  "00A809": "远距离",
  "00A81C": "低生命值时",
  "00A821": "刚触发过连续命中3次语音后，再命中第4次", // 法老之鹰
  "00A837": "使用穿鞋的皮肤",
  "00A893": "敌方西格玛使用穿鞋的皮肤",
  "00A894": "敌方西格玛使用未穿鞋的皮肤",
  "00A89A": "在空中", // 狂鼠、探奇
  "00A89E": "链钩命中后消灭",
  "00A8A8": "远距离", // 莱因哈特、渣客女王、卡西迪、布丽吉塔、莫伊拉
  "00A8A9": "血斩造成多个击杀",
  "00A8AB": "使用维和者辅助模式",
  "00A90D": "敌方卡西迪战术翻滚",
  "00A90E": "使用回春疾行后",
  "00A930": "使用终极技能期间被消灭",
  "00A966": "治疗光束连接低生命值盟友",
  "00AA26": "敌人被暴雪控制",
  "00AA98": "震荡冲击命中敌人",
  "00AA9A": "震荡冲击命中自己",
  "00AABA": "治疗重伤盟友",
  "00AABC": "将盟友治疗至满生命值", // 巴蒂斯特、生命之梭
  "00AAD3": "加时期间敌方控制机器人",
  "00AC10": "复制安娜后使用终极技能",
  "00AC12": "复制艾什后使用终极技能",
  "00AC14": "复制巴蒂斯特后使用终极技能",
  "00AC15": "复制堡垒后使用终极技能",
  "00AC16": "复制布丽吉塔后使用终极技能",
  "00AC17": "复制卡西迪后使用终极技能",
  "00AC18": "复制D.Va后使用终极技能",
  "00AC1A": "复制半藏后使用终极技能",
  "00AC1B": "复制狂鼠后使用终极技能",
  "00AC1C": "复制卢西奥后使用终极技能",
  "00AC1D": "复制天使后使用终极技能",
  "00AC1E": "复制奥丽莎后使用终极技能",
  "00AC1F": "复制法老之鹰后使用终极技能",
  "00AC21": "复制莱因哈特后使用终极技能",
  "00AC22": "复制路霸后使用终极技能",
  "00AD79": "使用增幅矩阵",
  "00AD8E": "近距离",
  "00ADCB": "敌人被裂地猛击控制",
  "00AE5B": "被侵入时",
  "00AF41": "被复活后",
  "00AF43": "敌人被复活后",
  "00B025": "冲锋消灭使用终极技能的敌人",
  "00B0A3": "从背后消灭",
  "00B0FB": "敌人落单", // 生命之梭
  "00B0FE": "唯一存活", // 拉玛刹、法老之鹰
  "00B142": "使用特斯拉炮辅助模式",
  "00B148": "期间造成至少2次消灭", // 退出原始暴怒
  "00B1DD": "期间造成至少3次消灭", // 退出机体超频
  "00B401": "敌方团灭后复生",
  "00B403": "造成地形消灭后被消灭", // 路霸、法老之鹰、卢西奥
  "00B404": "连杀后复生",
  "00B4D1": "被投射屏障助攻", // 莱因哈特
  "00B4D2": "消灭被查莉娅泡泡盾保护的敌人",
  "00B4D6": "被闪反弹消灭",
  "00B531": "消灭被生命之握的敌人",
  "00B58C": "复制渣客女王后使用终极技能",
  "00B670": "使用溅射伤害", // 法老之鹰
  "00B87B": "在白天/晴天地图",
  "00B87C": "在夜晚地图",
  "00B87D": "在雨天地图",
  "00B87E": "在夜晚地图", // 秩序之光
  "00B9B3": "使用红外侦测期间",
  "00B9B5": "敌方红外侦测期间",
  "00BA41": "复制索杰恩后使用终极技能",
  "00BA42": "复制雾子后使用终极技能",
  "00BA43": "复制拉玛刹后使用终极技能",
  "00BB2C": "非竞技比赛", // 推测
  "00BBF8": "使用能量标枪",
  "00BE61": "敌人使用花瓣平台",
  "00C003": "星际守望模式",
  "00C0C7": "被暴击消灭", // 猎空、探奇
  "00C0F0": "复制托比昂后使用终极技能",
  "00C40C": "复制生命之梭后使用终极技能",
  "00C473": "敌人使用终极技能时", // 猎空、安娜、朱诺、无漾
  "00C73D": "被自毁消灭", // 伊拉锐
  "00C786": "使用闪",
  "00CD39": "燃火链式机枪消灭",
  "00CF27": "敌方被乱影响", // 毛加
  "00D3AE": "复制伊拉锐后使用终极技能",
  "00D75B": "复制秩序之光后使用终极技能",
  "00D75D": "复制毛加后使用终极技能",
  "00E340": "被重力喷涌消灭", // 朱诺
  "00E754": "守望先锋经典版",
  "00E8CA": "愚人节活动模式", // 推测
  "00EA59": "终极技能配合团灭", // 骇灾
  "010063": "复制骇灾后使用终极技能",
  "010084": "复制朱诺后使用终极技能",
  "01011D": "复制探奇后使用终极技能",
  "010128": "复制破坏球后使用终极技能",
  "01012A": "复制查莉娅后使用终极技能",
  "0102AC": "复制弗蕾娅后使用终极技能",
  "01085F": "复制无漾后使用终极技能",
  "011AF8": "复制斩仇后使用终极技能",
  "011D39": "复制安燃后使用终极技能",
};

export const HeroQuoteScriptDesc_Unknown: Record<string, string> = {
  "00191E": "", // 大量受击音效使用 IsDvaMech
  "002841": "未知PVE条件", // 国王行动、哈瓦那行动、威尼斯行动
  "002843": "未知PVE条件", // 国王行动
  "002844": "未知PVE条件", // 国王行动
  "002E5B": "", // 卢西奥UltimateReady，只有NOT此条件时才会说音障
  "00331E": "", // 美UltimateReady，只有NOT此条件时才会说暴雪
  "0038CC": "未知PVE条件", // 威尼斯行动 卡西迪/源氏
  "0038DE": "未知PVE条件", // 威尼斯行动 卡西迪对莱耶斯
  "0038E0": "未知PVE条件", // 威尼斯行动 卡西迪/源氏 安东尼奥相关
  "0038E1": "未知PVE条件", // 威尼斯行动 卡西迪/莫伊拉 对莱耶斯
  "0038E2": "未知PVE条件", // 威尼斯行动 卡西迪对莱耶斯
  "0038E3": "未知PVE条件", // 威尼斯行动
  "0038E4": "未知PVE条件", // 威尼斯行动
  "0038E5": "未知PVE条件", // 威尼斯行动 卡西迪
  "0038F2": "未知PVE条件", // 威尼斯行动
  "0038F3": "未知PVE条件", // 威尼斯行动 卡西迪
  "004F6A": "未知PVE条件", // 哈瓦那行动
  "0051A4": "未知PVE条件", // 哈瓦那行动
  "0051A5": "未知PVE条件", // 哈瓦那行动
  "0051A6": "未知PVE条件", // 哈瓦那行动
  "0051A7": "未知PVE条件", // 哈瓦那行动
  "0051A8": "未知PVE条件", // 哈瓦那行动
  "0051A9": "未知PVE条件", // 哈瓦那行动
  "0059A2": "", // 西格玛终极技能消灭
  "0059A4": "", // 西格玛重生
  "007761": "", // 解放枷锁
  "007762": "", // 解放枷锁
  "009FE2": "", // 巴蒂斯特天赋
  "00A08F": "", // 温斯顿天赋
  "00A2DF": "", // 艾什召唤鲍勃 同台词不同语气
  "00A77A": "", // 法老之鹰/狂鼠
  "00AA28": "", // 朱诺消灭美
  "00AACA": "", // 温斯顿 疑似机动推进
  "00B3AD": "", // 地形消灭
  "00B41D": "", // 奥林匹斯之战
  "00B4E0": "使用花瓣平台起跳", // 生命之梭、黑百合
  "00B83D": "", // 莱因哈特 奥林匹斯之战相关
  "00B844": "", // 奥林匹斯之战 马匹之神
  "00BA44": "", // 莱因哈特MultiKill 疑似近战多杀
  "00BE5D": "", // 和“消灭被生命之握的敌人”一起出现
  "00C16D": "", // 猎空闪回
  "00C703": "", // 安娜 夏威夷
  "00CDD2": "UsingTrap 敌人被陷阱影响", // 拴猪圈、毛加
  "00E337": "", // 美、美助攻 块头大
  "00E339": "", // 斩仇消灭支援英雄
  "010026": "", // 巴蒂斯特终极技能，防护矩阵
};

export const HeroQuoteHeroNameMap: Record<string, string> = {
  UnknownAD3: "黑爪步兵",
  轰击者: "轰击者",
  切割者: "切割者",
  抑制者: "抑制者",

  鲍勃: "鲍勃",
  UnknownF5: "猎空",
  UnknownFA: "天使",
  UnknownFB: "半藏",
  Unknown100: "堡垒",
  Unknown101: "卡西迪",
  Unknown102: "查莉娅",
  UnknownE77: "骇灾",
  Unknown9C2: "回声",
};

export const HeroQuoteHeroTagNames: Record<string, string> = {
  Unknown37: "重装", // D.Va、巴蒂斯特
  UnknownD95: "希腊神话皮肤",
  UnknownDFE: "动物",
  UnknownDFF: "机械",
  UnknownE00: "人类",
  UnknownE3F: "星际守望无限军团皮肤",
  UnknownE40: "星际守望守望者皮肤",
  UnknownF0F: "黑爪",
  UnknownF10: "守望先锋",
  UnknownF11: "守望先锋",
  UnknownF5C: "暗黑破坏神皮肤",
  Unknown101A: "镜影守望黑爪皮肤",
  Unknown1019: "镜影守望守望先锋皮肤",
};

export const HeroQuoteCelebrationName: Record<string, string> = {
  "212E": "万圣夜惊魂",
  "212F": "夏季运动会",
  "2168": "雪国仙境",
  "2497": "新年",
  "2498": "春节活动",
  "24A6": "情人节",
  "24A7": "情人节",
  "258A": "愚人节",
  "2658": "圣帕特里克节",
  "2659": "复活节",
};

export const HeroQuoteGenderName = {
  Male: "male",
  Female: "female",
  0: "neutral",
} as const;
